<template>
  <div class="termsDiv absMiddle">
    <div class="top">
      <button class="fr" @click="close();">x</button>
    </div>
    <div class="content">
      <h2>农博创新服务条款</h2>
      <p>秉承平等互利的原则，签约双方经友好协商达成如下服务条款，供双方共同遵守执行。</p>
      <h3>一、定义</h3>
      <p>
        深圳市农博创新科技有限公司：是拥有和经营农博创新(<a href="http://www.nongbotech.cn">http://www.nongbotech.cn</a>)网站的公司，以下简称农博创新。<br>
        用户：与深圳市农博创新科技有限公司签约并实施《农博创新服务条款》的单位/个人。<br>
        合同：是深圳市农博创新科技有限公司与用户就农博创新农场管理系统服务签订的《农博创新服务合同》。<br>
      </p>
      <h3>二、用户的权利和义务</h3>
      <p>
        1、用户有权使用农博创新提供的服务管理农场业务。<br>
        2、用户有权根据农博创新售后服务及品质保障的相关承诺，获得良好的产品及服务。<br>
        3、用户在农博创新的数据归属用户所有，用户有权进行任何形式的处置。<br>
        4、用户需提供及时、详尽及准确的个人资料。<br>
        4、用户不得对农博创新产品进行任何形式的对其他第三方的再授权使用，销售或转让。<br>
        5、一旦注册成功成为农博创新用户，用户将得到一个密码和账号，用户应对自己的账号密码的保密性负责，因用户维护或保密不善致使相关信息泄露或造成其他损失，由用户自行负责。<br>
        6、用户必须遵守《计算机信息网络国际联网安全保护管理办法》、《中华人民共和国计算机信息网络国际联网管理暂行规定》、《中华人民共和国计算机信息系统安全保护条例》、《中华人民共和国电信条例》、《互联网信息服务管理办法》、《互联网电子公告服务管理规定》和国家其他有关法律、法规、行政规章，不得制作、复制、发布、传播任何法律法规禁止的有害信息。用户对其经营行为和发布的信息违反上述规定而引起的任何政治责任、法律责任负全责，若因此而给农博创新造成损失，农博创新保留追究用户法律责任的权利。<br>
      </p>
      <h3>三、农博创新的权利和义务</h3>
      <p>
        1、农博创新有权按合同约定的形式、期限和数额向用户收取费用。<br>
        2、农博创新有义务根据农博创新农场管理系统售后服务及品质保证的相关承诺，提供良好的产品应用及服务。<br>
        3、农博创新有义务向用户提供农博创新农场管理系统的使用培训和技术支持服务，确保用户能自行使用和维护农博创新农场管理系统。<br>
      </p>
      <h4>农博创新提供的技术服务如下:</h4>
      <p>
        （1）在线客服:如用户在农博创新农场管理系统使用过程中遇到问题，农博创新可通过互联网进行在线服务，指导软件的应用，排除系统在使用过程中发生的故障。<br>
        （2）电话支持:农博创新为用户提供电话热线服务，指导用户有关农博创新农场管理系统使用过程中遇到的问题。<br>
        4、在合同服务期限内，农博创新免费向用户提供系统升级服务。<br>
        5、用户在农博创新农场管理系统的数据属于用户的商业秘密，农博创新声明无论合同是否终止，在未经用户许可前，不会将上述商业秘密向其他任何第三方泄露或允许任何第三方使用，根据法律要求的除外，农博创新可以向第三方用户提供没有明显用户标示的汇总统计类数据。<br>
      </p>
      <h3>四、其他</h3>
      <p>
        1、农博创新农场管理系统在进行服务器配置、维护时，在必要的情况下需要短时间中断服务，或者由于 Internet 上的通路的偶然阻塞造成用户访问速度下降，及农博创新农场管理系统不可预见、不可控制的技术故障及其它不可预见、不可控制的故障，用户认同这属于农博创新免责范畴。<br>
        2、如果因农博创新过错造成农博创新农场管理系统不能提供正常服务，或服务未能达到农博创新农场管理系统售后服务及品质保证的标准，经甲乙双方签字确认后，农博创新需补偿用户宕机或服务中断的使用时间。<br>
        3、农博创新将尽最大努力保障用户数据的安全备份，承诺在有任何用户数据因服务器存储设备损坏时以最近的备份中恢复数据。在发生需要从备份文件中恢复数据的情形时，农博创新通常需要4小时以上，最长48小时完成。但农博创新无法承诺100% 的数据恢复，对因数据丢失带来的其他连带或间接损失不承担任何责任。<br>
      </p>
      <h3>五、条款修订</h3>
      <p>
        1、农博创新有权根据中华人民共和国有关法律、法规、市场行情及网络技术的发展变化，不断修改完善本服务条款。若用户需要继续使用农博创新农场管理系统服务，有义务对最新的服务条款进行确认，用户继续使用农博创新农场管理系统服务的，视为接受服务条款的修改。<br>
        2、修订的条款始终公开在公司官网：<a href="http://www.nongbotech.cn">http://www.nongbotech.cn</a><br>
      </p>
    </div>
  </div>
</template>

<script>
  export default {
    name: 'terms',
    data () {
      return {
      };
    },
    methods: {
      close: function () {
        this.$emit('close');
      }
    }
  };
</script>

<style scoped lang="scss">
  .termsDiv {
    width: 600px;
    height: 630px;
    background: #fff;
    .top {
      height: 30px;
      width: 100%;
      background: #CCCCCC;
      button {
        width: 30px;
        height: 30px;
        font-size: 20px;
        cursor: pointer;
        outline: none;
        background-color: #CCCCCC;
        border: 0;
      }
    }
    .content {
      height: 600px;
      padding: 0 10px;
      overflow: auto;
      h3,h4,p{
        line-height: 30px;
      }
      h2 {
        height: 57px;
        line-height: 57px;
        margin: 0 auto;
        vertical-align: middle;
        text-align: center;
        font-size: 28px;
        font-weight: normal;
        color: #272727;
      }
      h3 {
        color: #000;
        font-weight: bold;
      }
      a{
        color: blue;
      }
    }
  }
</style>
